# Data exploration

This serves only for exploration purposes, no real implementation or prediction here

In [1]:
import pandas as pd
import numpy as np

In [18]:
# Reading all the data

movies = pd.read_csv('../data/movies.csv', delimiter=';', dtype={'movieID':'int', 'year':'int', 'movie':'str'}, names=['movieID', 'year', 'movie'])
predictions = pd.read_csv('../data/predictions.csv', delimiter=';', names=['userID', 'movieID'], header=None)
ratings = pd.read_csv('../data/ratings.csv', delimiter=';', dtype={'userID':'int', 'movieID':'int', 'rating':'int'}, names=['userID', 'movieID', 'rating'])
user = pd.read_csv('../data/users.csv', delimiter=';', dtype={'userID':'int', 'gender':'str', 'age':'int', 'profession':'int'}, names=['userID', 'gender', 'age', 'profession'])

submission = pd.read_csv('../data/submission.csv')

## Movies

In [5]:
movies.tail()

      movieID  year                       movie
3701     3702  2000     Meet_the_Parents_(2000)
3702     3703  2000  Requiem_for_a_Dream_(2000)
3703     3704  2000            Tigerland_(2000)
3704     3705  2000     Two_Family_House_(2000)
3705     3706  2000       Contender,_The_(2000)

In [3]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3706 entries, 0 to 3705
Data columns (total 3 columns):
movieID    3706 non-null int32
year       3706 non-null int32
movie      3706 non-null object
dtypes: int32(2), object(1)
memory usage: 58.0+ KB

## Predictions

In [19]:
#predictions.sort_values('userID')
#predictions['userID'].value_counts()
predictions.head()

   userID  movieID
0    1635     1914
1    2077     2124
2    3507     1582
3    1117     2857
4    5298     3281

## Ratings

In [55]:
#r = ratings.groupby('userID', as_index=False, sort=False).mean().drop().rename(columns:{'userID': 'userID'})
# r = ratings.groupby('movieID').size().reset_index(name='count')
# r['count'].value_counts()

r = ratings.groupby('userID', as_index=False, sort=False) \
    .mean() \
    .rename(columns={'userID': 'userID', 'rating' : 'mean_rating'})

r.drop('movieID', axis=1, inplace=True)
#r = ratings.groupby('userID', as_index=False, sort=False)['rating'].mean()

new_r = ratings.merge(r, how='left', on='userID', sort=False)
#ratings['userID'].value_counts()

new_r['centered_cosine'] = new_r['rating'] - new_r['mean_rating']

new_r.head()

   userID  movieID  rating  mean_rating  centered_cosine
0    5494     2006       4     3.931507         0.068493
1    3579     1143       3     3.326772        -0.326772
2    1251     2567       2     3.404762        -1.404762
3    5687      652       4     3.756757         0.243243
4    3018     3440       4     3.701439         0.298561

## Submission

In [8]:
submission.head()

   Id  Rating
0   1  3.5813
1   2  3.5813
2   3  3.5813
3   4  3.5813
4   5  3.5813

## Users

In [4]:
user.tail()

      userID gender  age  profession
6035    6036      F   25          15
6036    6037      F   45           1
6037    6038      F   56           1
6038    6039      F   45           0
6039    6040      M   25           6